eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/STM32F413H-Discovery/Applications/2_Images/2_Images_UserApp/Src/fw_update_app.c
  while (exit == 0U)
  {
    key = 0U;
    slot_number = 0U;

    /* If the SecureBoot configured the IWDG, UserApp must reload IWDG counter with value defined in the
       reload register */
    WRITE_REG(IWDG->KR, IWDG_KEY_RELOAD);

    /* Clean the input path */
    COM_Flush();

    /* Receive key */
    if (COM_Receive(&key, 1U, RX_TIMEOUT) == HAL_OK)
    {
      switch (key)
      {
        case '1' :
          slot_number = SLOT_DWL_1 + 0U;
          break;
        case '2' :
          slot_number = SLOT_DWL_1 + 1U;
          break;
        case '3' :
          slot_number = SLOT_DWL_1 + 2U;
          break;
        case '4' :
          /*
           * When IMAGE_STATE_HANDLING switch is not activated :
           *  - requesting installation means writing the header in the SWAP slot then reset.
           *  - else, reset is enough. Image state set as NEW in the header of dwl_slot will identify the dwl_slot
           *    to install.
           */
          /* Get Info about the download area */
          SFU_APP_GetDownloadAreaInfo(fw_to_install, &fw_image_dwl_area);

          /* Read header in dwl slot */
          FLASH_If_Read(fw_header_dwl_slot, (void *) fw_image_dwl_area.DownloadAddr, SE_FW_HEADER_TOT_LEN);

          /* Ask for installation at next reset */
          (void)SFU_APP_InstallAtNextReset((uint8_t *) fw_header_dwl_slot);

          /* System Reboot*/
          printf("  -- Installation requested - Reboot");
          HAL_Delay(1000U);
          /*  use virtual HAL API allowing the access to Privileged register */
          SVC_NVIC_SystemReset();
          break;
        case 'x' :
          exit = 1U;
          break;

        default:
          printf("Invalid Number !\r");
          break;
      }

      if (slot_number != 0U)
      {
        /* Get Info about the download area */
        SFU_APP_GetDownloadAreaInfo(slot_number, &fw_image_dwl_area);

        if ((fw_image_dwl_area.DownloadAddr != 0U) && (fw_image_dwl_area.MaxSizeInBytes != 0U))
        {
          /* Download new firmware image*/
          if (FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area) == HAL_OK)
          {
            fw_to_install = slot_number;
          }
          else
          {
            printf("  -- !!Download failed!! \r\n\n");
            HAL_Delay(1000U);
          }
        }
        else
        {
          printf("  -- !!Download slot not configured!! \r\n\n");
          HAL_Delay(1000U);
        }
      }

      /* Print Menu */
      FW_UPDATE_MULTIPLE_PrintMenu();
    }
  }
}
#endif /* EXTERNAL_LOADER */

#if !defined(EXTERNAL_LOADER)
/**
  * @brief Download a new Firmware from the host.
  * @retval HAL status
  */
static HAL_StatusTypeDef FW_UPDATE_DownloadNewFirmware(SFU_FwImageFlashTypeDef *pFwImageDwlArea)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  COM_StatusTypeDef e_result;
  uint32_t u_fw_size;
  YMODEM_CallbacksTypeDef ymodemCb = {Ymodem_HeaderPktRxCpltCallback, Ymodem_DataPktRxCpltCallback};

  printf("  -- Send Firmware \r\n\n");
  /* Refresh Watchdog */
  WRITE_REG(IWDG->KR, IWDG_KEY_RELOAD);

  /* Clear download area */
  printf("  -- -- Erasing download area ...\r\n\n");
  if ((ret = FLASH_If_Erase_Size((void *)(pFwImageDwlArea->DownloadAddr), pFwImageDwlArea->MaxSizeInBytes)) == HAL_OK)
  {
    /* Download binary */
    printf("  -- -- File> Transfer> YMODEM> Send ");

    /*Init of Ymodem*/
    Ymodem_Init();

    /*Receive through Ymodem*/
    e_result = Ymodem_Receive(&u_fw_size, pFwImageDwlArea->DownloadAddr, &ymodemCb);
    printf("\r\n\n");

    if ((e_result == COM_OK))
    {
      printf("  -- -- Programming Completed Successfully!\r\n\n");
      printf("  -- -- Bytes: %d\r\n\n", u_fw_size);
      ret = HAL_OK;
    }
    else if (e_result == COM_ABORT)
    {
      printf("  -- -- !!Aborted by user!!\r\n\n");
      ret = HAL_ERROR;
    }
    else
    {
      printf("  -- -- !!Error during file download!!\r\n\n");
      ret = HAL_ERROR;
    }
  }
  return ret;
}
#endif /* !(EXTERNAL_LOADER) */

#if defined(ENABLE_IMAGE_STATE_HANDLING)
/**
  * @brief  Display the validation firmware menu choices on hyperterminal
  * @param  None.
  * @retval None.
  */
static void FW_VALIDATE_PrintMenu(void)
{
  printf("\r\n========== Validation of FW Image ============\r\n\n");
  printf("  Validate all firmwares ------------------------- 0\r\n\n");
  printf("  Validate firmware of SLOT_ACTIVE_1 ------------- 1\r\n\n");
  printf("  Validate firmware of SLOT_ACTIVE_2 ------------- 2\r\n\n");
  printf("  Validate firmware of SLOT_ACTIVE_3 ------------- 3\r\n\n");
  printf("  Previous Menu ---------------------------------- x\r\n\n");
  printf("  Selection :\r\n\n");
}

#if   defined(SFU_MPU_PROTECT_ENABLE)
/**
  * @brief Validate a Active Firmware.
  * @param peSE_Status Status.
  * @param SlotNumber index of the slot in the list
  * @retval SE_ErrorStatus SE_SUCCESS if successful, SE_ERROR otherwise.
  */
static SE_ErrorStatus FW_VALIDATE_ValidateFw(SE_StatusTypeDef *peSE_Status, uint32_t SlotNumber)
{
  SE_ErrorStatus e_ret_status;
  SE_FwStateTypeDef current_fw_state;
  SE_FwStateTypeDef next_fw_state;
  uint32_t current_slot;

  /* Identify the concerned slot */
  if (SlotNumber == VALID_ALL_SLOTS)
  {
    next_fw_state = FWIMG_STATE_VALID_ALL;
    current_slot = MASTER_SLOT;
  }
  else
  {
    next_fw_state = FWIMG_STATE_VALID;
    current_slot = SlotNumber;
  }

  /* Get the active image state from RAM */
  e_ret_status = FW_VALIDATE_GetActiveFwState(peSE_Status, current_slot, &current_fw_state);

  if (e_ret_status == SE_SUCCESS)
  {
    /* Check that the current fw state is valid */
    if (current_fw_state != FWIMG_STATE_SELFTEST )
    {
      printf("Firmware not is SELF_TEST state\r\n");
      e_ret_status = SE_ERROR;
    }
    else
    {
      if (next_fw_state == FWIMG_STATE_VALID_ALL)
      {
        FWIMG_STATE[current_slot - SLOT_ACTIVE_1] = FWIMG_STATE_TAG_VALID_ALL;
        e_ret_status = SE_SUCCESS;
      }
      else
      {
        FWIMG_STATE[current_slot - SLOT_ACTIVE_1] = FWIMG_STATE_TAG_VALID;
        e_ret_status = SE_SUCCESS;
      }
    }
  }

  return e_ret_status;
}

/**
  * @brief Retrieve an Active Firmware state.
  * @param peSE_Status Status.
  * @param SlotNumber index of the slot in the list
  * @param pFwState Active Firmware state structure that will be filled.
  * @retval SE_ErrorStatus SE_SUCCESS if successful, SE_ERROR otherwise.
  */
static SE_ErrorStatus FW_VALIDATE_GetActiveFwState(SE_StatusTypeDef *peSE_Status, uint32_t SlotNumber, SE_FwStateTypeDef *pFwState)
{
  SE_ErrorStatus e_ret_status;

  /* Stub the SE status */
  *peSE_Status = SE_OK;

  /* Control parameter : SlotNumber */
  if (((SlotNumber >= SLOT_ACTIVE_1) && (SlotNumber < (SLOT_ACTIVE_1 + SFU_NB_MAX_ACTIVE_IMAGE))) ||
      ((SlotNumber >= SLOT_DWL_1) && (SlotNumber < (SLOT_DWL_1 + SFU_NB_MAX_DWL_AREA))))
  {
    /* Translate the RAM state into SE state */
    switch (FWIMG_STATE[SlotNumber - SLOT_ACTIVE_1])
    {
      case FWIMG_STATE_TAG_INVALID:
      {
        *pFwState = FWIMG_STATE_INVALID;
        e_ret_status = SE_SUCCESS;
        break;
      }
      case FWIMG_STATE_TAG_VALID:
      {
        *pFwState = FWIMG_STATE_VALID;
        e_ret_status = SE_SUCCESS;
        break;
      }
      case FWIMG_STATE_TAG_VALID_ALL:
      {
        *pFwState = FWIMG_STATE_VALID_ALL;
        e_ret_status = SE_SUCCESS;
        break;
      }
      case FWIMG_STATE_TAG_SELFTEST:
      {
        *pFwState = FWIMG_STATE_SELFTEST;
        e_ret_status = SE_SUCCESS;
        break;
      }
      case FWIMG_STATE_TAG_NEW:
      {
        *pFwState = FWIMG_STATE_NEW;
        e_ret_status = SE_SUCCESS;
        break;
      }
      default:
      {
        *pFwState = FWIMG_STATE_INVALID;
        e_ret_status = SE_ERROR;
        break;
      }
    }
  }
  else
  {
    *pFwState = FWIMG_STATE_INVALID;
    e_ret_status = SE_ERROR;
  }

  return e_ret_status;
}
#endif /* SFU_XXX_PROTECT_ENABLE */
#endif /* (ENABLE_IMAGE_STATE_HANDLING) */

/**
  * @brief  Run validation of a FW image menu.
  * @param  None
  * @retval None.
  */
void FW_VALIDATE_RunMenu(void)
{
#if defined(ENABLE_IMAGE_STATE_HANDLING)
  uint8_t key = 0U;
  uint32_t exit = 0U;
  uint32_t slot_number = 0U;
  SE_ErrorStatus se_retCode = SE_ERROR;
  SE_StatusTypeDef se_Status = SE_KO;
  SE_FwStateTypeDef fw_state = FWIMG_STATE_INVALID;

  /*Print Main Menu message*/
  FW_VALIDATE_PrintMenu();

